In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukverisi={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[35,38,40]}
havadurumuDataFrame=pd.DataFrame(sozlukverisi)

In [3]:
havadurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     35
1      29.0     NaN     38
2       NaN    25.0     40

In [4]:
havadurumuDataFrame.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     35

In [5]:
havadurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     35
1      29.0     NaN     38
2       NaN    25.0     40

In [6]:
havadurumuDataFrame.dropna(axis=1)

   izmir
0     35
1     38
2     40

In [9]:
yeniveri={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[35,38,40],"antalya":[45,np.nan,np.nan],"hatay":[37,38,43]}
yeniVeriDataFrame=pd.DataFrame(yeniveri)

In [10]:
yeniVeriDataFrame

   istanbul  ankara  izmir  antalya  hatay
0      30.0    20.0     35     45.0     37
1      29.0     NaN     38      NaN     38
2       NaN    25.0     40      NaN     43

In [11]:
yeniVeriDataFrame.dropna(axis=1,thresh=2)

   istanbul  ankara  izmir  hatay
0      30.0    20.0     35     37
1      29.0     NaN     38     38
2       NaN    25.0     40     43

In [12]:
yeniVeriDataFrame

   istanbul  ankara  izmir  antalya  hatay
0      30.0    20.0     35     45.0     37
1      29.0     NaN     38      NaN     38
2       NaN    25.0     40      NaN     43

In [13]:
yeniVeriDataFrame.fillna(20)

   istanbul  ankara  izmir  antalya  hatay
0      30.0    20.0     35     45.0     37
1      29.0    20.0     38     20.0     38
2      20.0    25.0     40     20.0     43

## groupby

In [17]:
maasSozlugu={"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
            "calisan ismi":["ali","kemal","ayse","kaya","demir","hakan"],
            "maas":[100,150,200,250,300,350]
            }

In [18]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [19]:
maasDataFrame

   departman calisan ismi  maas
0    yazılım          ali   100
1    yazılım        kemal   150
2  pazarlama         ayse   200
3  pazarlama         kaya   250
4      hukuk        demir   300
5      hukuk        hakan   350

In [21]:
groupobje=maasDataFrame.groupby("departman")

In [23]:
groupobje.count()

           calisan ismi  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [24]:
groupobje.mean()

C:\Users\Acer\AppData\Local\Temp\ipykernel_22380\1566289468.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupobje.mean()

            maas
departman
hukuk      325.0
pazarlama  225.0
yazılım    125.0

In [25]:
groupobje.max()

          calisan ismi  maas
departman
hukuk            hakan   350
pazarlama         kaya   250
yazılım          kemal   150

In [26]:
groupobje.min()

          calisan ismi  maas
departman
hukuk            demir   300
pazarlama         ayse   200
yazılım            ali   100

In [27]:
groupobje.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  325.0  35.355339  300.0  312.5  325.0  337.5  350.0
pazarlama   2.0  225.0  35.355339  200.0  212.5  225.0  237.5  250.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0